zephyrproject-rtos/hal_silabs/simplicity_sdk/platform/Device/SiliconLabs/BGM26/Include/bgm26_pcnt.h
/* Bit fields for PCNT CTRL */
#define _PCNT_CTRL_RESETVALUE                   0x00000000UL                            /**< Default value for PCNT_CTRL                 */
#define _PCNT_CTRL_MASK                         0x000000F7UL                            /**< Mask for PCNT_CTRL                          */
#define PCNT_CTRL_S1CDIR                        (0x1UL << 0)                            /**< Count Direction Determined By S1            */
#define _PCNT_CTRL_S1CDIR_SHIFT                 0                                       /**< Shift value for PCNT_S1CDIR                 */
#define _PCNT_CTRL_S1CDIR_MASK                  0x1UL                                   /**< Bit mask for PCNT_S1CDIR                    */
#define _PCNT_CTRL_S1CDIR_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for PCNT_CTRL                  */
#define PCNT_CTRL_S1CDIR_DEFAULT                (_PCNT_CTRL_S1CDIR_DEFAULT << 0)        /**< Shifted mode DEFAULT for PCNT_CTRL          */
#define PCNT_CTRL_CNTDIR                        (0x1UL << 1)                            /**< Non-Quadrature Mode Counter Direction Co    */
#define _PCNT_CTRL_CNTDIR_SHIFT                 1                                       /**< Shift value for PCNT_CNTDIR                 */
#define _PCNT_CTRL_CNTDIR_MASK                  0x2UL                                   /**< Bit mask for PCNT_CNTDIR                    */
#define _PCNT_CTRL_CNTDIR_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for PCNT_CTRL                  */
#define _PCNT_CTRL_CNTDIR_UP                    0x00000000UL                            /**< Mode UP for PCNT_CTRL                       */
#define _PCNT_CTRL_CNTDIR_DOWN                  0x00000001UL                            /**< Mode DOWN for PCNT_CTRL                     */
#define PCNT_CTRL_CNTDIR_DEFAULT                (_PCNT_CTRL_CNTDIR_DEFAULT << 1)        /**< Shifted mode DEFAULT for PCNT_CTRL          */
#define PCNT_CTRL_CNTDIR_UP                     (_PCNT_CTRL_CNTDIR_UP << 1)             /**< Shifted mode UP for PCNT_CTRL               */
#define PCNT_CTRL_CNTDIR_DOWN                   (_PCNT_CTRL_CNTDIR_DOWN << 1)           /**< Shifted mode DOWN for PCNT_CTRL             */
#define PCNT_CTRL_EDGE                          (0x1UL << 2)                            /**< Edge Select                                 */
#define _PCNT_CTRL_EDGE_SHIFT                   2                                       /**< Shift value for PCNT_EDGE                   */
#define _PCNT_CTRL_EDGE_MASK                    0x4UL                                   /**< Bit mask for PCNT_EDGE                      */
#define _PCNT_CTRL_EDGE_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for PCNT_CTRL                  */
#define _PCNT_CTRL_EDGE_POS                     0x00000000UL                            /**< Mode POS for PCNT_CTRL                      */
#define _PCNT_CTRL_EDGE_NEG                     0x00000001UL                            /**< Mode NEG for PCNT_CTRL                      */
#define PCNT_CTRL_EDGE_DEFAULT                  (_PCNT_CTRL_EDGE_DEFAULT << 2)          /**< Shifted mode DEFAULT for PCNT_CTRL          */
#define PCNT_CTRL_EDGE_POS                      (_PCNT_CTRL_EDGE_POS << 2)              /**< Shifted mode POS for PCNT_CTRL              */
#define PCNT_CTRL_EDGE_NEG                      (_PCNT_CTRL_EDGE_NEG << 2)              /**< Shifted mode NEG for PCNT_CTRL              */
#define _PCNT_CTRL_CNTEV_SHIFT                  4                                       /**< Shift value for PCNT_CNTEV                  */
#define _PCNT_CTRL_CNTEV_MASK                   0x30UL                                  /**< Bit mask for PCNT_CNTEV                     */
#define _PCNT_CTRL_CNTEV_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for PCNT_CTRL                  */
#define _PCNT_CTRL_CNTEV_BOTH                   0x00000000UL                            /**< Mode BOTH for PCNT_CTRL                     */
#define _PCNT_CTRL_CNTEV_UP                     0x00000001UL                            /**< Mode UP for PCNT_CTRL                       */
#define _PCNT_CTRL_CNTEV_DOWN                   0x00000002UL                            /**< Mode DOWN for PCNT_CTRL                     */
#define PCNT_CTRL_CNTEV_DEFAULT                 (_PCNT_CTRL_CNTEV_DEFAULT << 4)         /**< Shifted mode DEFAULT for PCNT_CTRL          */
#define PCNT_CTRL_CNTEV_BOTH                    (_PCNT_CTRL_CNTEV_BOTH << 4)            /**< Shifted mode BOTH for PCNT_CTRL             */
#define PCNT_CTRL_CNTEV_UP                      (_PCNT_CTRL_CNTEV_UP << 4)              /**< Shifted mode UP for PCNT_CTRL               */
#define PCNT_CTRL_CNTEV_DOWN                    (_PCNT_CTRL_CNTEV_DOWN << 4)            /**< Shifted mode DOWN for PCNT_CTRL             */
#define _PCNT_CTRL_AUXCNTEV_SHIFT               6                                       /**< Shift value for PCNT_AUXCNTEV               */
#define _PCNT_CTRL_AUXCNTEV_MASK                0xC0UL                                  /**< Bit mask for PCNT_AUXCNTEV                  */
#define _PCNT_CTRL_AUXCNTEV_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for PCNT_CTRL                  */
#define _PCNT_CTRL_AUXCNTEV_BOTH                0x00000000UL                            /**< Mode BOTH for PCNT_CTRL                     */
#define _PCNT_CTRL_AUXCNTEV_UP                  0x00000001UL                            /**< Mode UP for PCNT_CTRL                       */
#define _PCNT_CTRL_AUXCNTEV_DOWN                0x00000002UL                            /**< Mode DOWN for PCNT_CTRL                     */
#define PCNT_CTRL_AUXCNTEV_DEFAULT              (_PCNT_CTRL_AUXCNTEV_DEFAULT << 6)      /**< Shifted mode DEFAULT for PCNT_CTRL          */
#define PCNT_CTRL_AUXCNTEV_BOTH                 (_PCNT_CTRL_AUXCNTEV_BOTH << 6)         /**< Shifted mode BOTH for PCNT_CTRL             */
#define PCNT_CTRL_AUXCNTEV_UP                   (_PCNT_CTRL_AUXCNTEV_UP << 6)           /**< Shifted mode UP for PCNT_CTRL               */
#define PCNT_CTRL_AUXCNTEV_DOWN                 (_PCNT_CTRL_AUXCNTEV_DOWN << 6)         /**< Shifted mode DOWN for PCNT_CTRL             */

/* Bit fields for PCNT CMD */
#define _PCNT_CMD_RESETVALUE                    0x00000000UL                            /**< Default value for PCNT_CMD                  */
#define _PCNT_CMD_MASK                          0x00000F17UL                            /**< Mask for PCNT_CMD                           */
#define PCNT_CMD_CORERST                        (0x1UL << 0)                            /**< PCNT Clock Domain Reset                     */
#define _PCNT_CMD_CORERST_SHIFT                 0                                       /**< Shift value for PCNT_CORERST                */
#define _PCNT_CMD_CORERST_MASK                  0x1UL                                   /**< Bit mask for PCNT_CORERST                   */
#define _PCNT_CMD_CORERST_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for PCNT_CMD                   */
#define PCNT_CMD_CORERST_DEFAULT                (_PCNT_CMD_CORERST_DEFAULT << 0)        /**< Shifted mode DEFAULT for PCNT_CMD           */
#define PCNT_CMD_CNTRST                         (0x1UL << 1)                            /**< CNT Reset                                   */
#define _PCNT_CMD_CNTRST_SHIFT                  1                                       /**< Shift value for PCNT_CNTRST                 */
#define _PCNT_CMD_CNTRST_MASK                   0x2UL                                   /**< Bit mask for PCNT_CNTRST                    */
#define _PCNT_CMD_CNTRST_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for PCNT_CMD                   */
#define PCNT_CMD_CNTRST_DEFAULT                 (_PCNT_CMD_CNTRST_DEFAULT << 1)         /**< Shifted mode DEFAULT for PCNT_CMD           */
#define PCNT_CMD_AUXCNTRST                      (0x1UL << 2)                            /**< AUXCNT Reset                                */
#define _PCNT_CMD_AUXCNTRST_SHIFT               2                                       /**< Shift value for PCNT_AUXCNTRST              */
#define _PCNT_CMD_AUXCNTRST_MASK                0x4UL                                   /**< Bit mask for PCNT_AUXCNTRST                 */
#define _PCNT_CMD_AUXCNTRST_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for PCNT_CMD                   */
#define PCNT_CMD_AUXCNTRST_DEFAULT              (_PCNT_CMD_AUXCNTRST_DEFAULT << 2)      /**< Shifted mode DEFAULT for PCNT_CMD           */
#define PCNT_CMD_LCNTIM                         (0x1UL << 4)                            /**< Load CNT Immediately                        */
#define _PCNT_CMD_LCNTIM_SHIFT                  4                                       /**< Shift value for PCNT_LCNTIM                 */
#define _PCNT_CMD_LCNTIM_MASK                   0x10UL                                  /**< Bit mask for PCNT_LCNTIM                    */
#define _PCNT_CMD_LCNTIM_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for PCNT_CMD                   */
#define PCNT_CMD_LCNTIM_DEFAULT                 (_PCNT_CMD_LCNTIM_DEFAULT << 4)         /**< Shifted mode DEFAULT for PCNT_CMD           */
#define PCNT_CMD_STARTCNT                       (0x1UL << 8)                            /**< Start Main Counter                          */
#define _PCNT_CMD_STARTCNT_SHIFT                8                                       /**< Shift value for PCNT_STARTCNT               */
#define _PCNT_CMD_STARTCNT_MASK                 0x100UL                                 /**< Bit mask for PCNT_STARTCNT                  */
#define _PCNT_CMD_STARTCNT_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for PCNT_CMD                   */
#define PCNT_CMD_STARTCNT_DEFAULT               (_PCNT_CMD_STARTCNT_DEFAULT << 8)       /**< Shifted mode DEFAULT for PCNT_CMD           */
#define PCNT_CMD_STARTAUXCNT                    (0x1UL << 9)                            /**< Start Aux Counter                           */
#define _PCNT_CMD_STARTAUXCNT_SHIFT             9                                       /**< Shift value for PCNT_STARTAUXCNT            */
#define _PCNT_CMD_STARTAUXCNT_MASK              0x200UL                                 /**< Bit mask for PCNT_STARTAUXCNT               */
#define _PCNT_CMD_STARTAUXCNT_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for PCNT_CMD                   */
#define PCNT_CMD_STARTAUXCNT_DEFAULT            (_PCNT_CMD_STARTAUXCNT_DEFAULT << 9)    /**< Shifted mode DEFAULT for PCNT_CMD           */
#define PCNT_CMD_STOPCNT                        (0x1UL << 10)                           /**< Stop Main Counter                           */
#define _PCNT_CMD_STOPCNT_SHIFT                 10                                      /**< Shift value for PCNT_STOPCNT                */
#define _PCNT_CMD_STOPCNT_MASK                  0x400UL                                 /**< Bit mask for PCNT_STOPCNT                   */
#define _PCNT_CMD_STOPCNT_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for PCNT_CMD                   */
#define PCNT_CMD_STOPCNT_DEFAULT                (_PCNT_CMD_STOPCNT_DEFAULT << 10)       /**< Shifted mode DEFAULT for PCNT_CMD           */
#define PCNT_CMD_STOPAUXCNT                     (0x1UL << 11)                           /**< Stop Aux Counter                            */
#define _PCNT_CMD_STOPAUXCNT_SHIFT              11                                      /**< Shift value for PCNT_STOPAUXCNT             */
#define _PCNT_CMD_STOPAUXCNT_MASK               0x800UL                                 /**< Bit mask for PCNT_STOPAUXCNT                */
#define _PCNT_CMD_STOPAUXCNT_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for PCNT_CMD                   */
#define PCNT_CMD_STOPAUXCNT_DEFAULT             (_PCNT_CMD_STOPAUXCNT_DEFAULT << 11)    /**< Shifted mode DEFAULT for PCNT_CMD           */

